Ran Plan for dir: `terraform/environments/prod/atlantis` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/ryu-qqq/Infrastructure/80/default/terraform/environments/prod/atlantis/atlantis-prod-default.tfplan\"" in "/home/atlantis/.atlantis/repos/ryu-qqq/Infrastructure/80/default/terraform/environments/prod/atlantis": exit status 1
aws_security_group.atlantis-efs: Refreshing state... [id=sg-00b4a4594212637d2]
aws_iam_role_policy_attachment.ecs-task-execution-policy: Refreshing state... [id=atlantis-ecs-task-execution-prod-20251011072359683400000003]
aws_lb_listener.atlantis-https: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:listener/app/atlantis-prod/665f4d0af1d0e39d/f91ddbf7d4915967]
aws_ecr_repository_policy.atlantis: Refreshing state... [id=atlantis]
aws_iam_role_policy.atlantis-cloudwatch-logs: Refreshing state... [id=atlantis-ecs-task-prod:atlantis-cloudwatch-logs]
aws_security_group.vpc-endpoints: Refreshing state... [id=sg-08366fa4751299ef2]
aws_lb.atlantis: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:loadbalancer/app/atlantis-prod/665f4d0af1d0e39d]
aws_lb_target_group.atlantis: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:targetgroup/atl-20251011072359287200000001/2c46e9934484e453]
aws_iam_role_policy.ecs-task-execution-kms: Refreshing state... [id=atlantis-ecs-task-execution-prod:atlantis-ecs-task-execution-kms]
aws_iam_role.ecs-task: Refreshing state... [id=atlantis-ecs-task-prod]
aws_cloudwatch_log_group.atlantis: Refreshing state... [id=/ecs/atlantis-prod]
aws_ecr_lifecycle_policy.atlantis: Refreshing state... [id=atlantis]
aws_security_group.atlantis-alb: Refreshing state... [id=sg-02b0ffd94dd79e5a4]
aws_iam_role_policy.ecs-task-execution-secrets: Refreshing state... [id=atlantis-ecs-task-execution-prod:atlantis-ecs-task-execution-secrets]
aws_security_group.atlantis-ecs-tasks: Refreshing state... [id=sg-09eda99303e72ca2d]
aws_ecr_repository.atlantis: Refreshing state... [id=atlantis]
aws_iam_role.ecs-task-execution: Refreshing state... [id=atlantis-ecs-task-execution-prod]
aws_lb_listener.atlantis-http: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:listener/app/atlantis-prod/665f4d0af1d0e39d/ae9a38e85b067308]
module.atlantis_task_role.data.aws_region.current: Reading...
module.atlantis_task_role.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
aws_secretsmanager_secret.atlantis-webhook-secret: Refreshing state... [id=arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/webhook-secret-v2-prod-JSD4P7]
aws_efs_file_system.atlantis: Refreshing state... [id=fs-0404558fae26deb97]
aws_ecs_cluster.atlantis: Refreshing state... [id=arn:aws:ecs:ap-northeast-2:646886795421:cluster/atlantis-prod]
data.aws_vpc.main: Reading...
aws_kms_key.efs: Refreshing state... [id=16ebdf02-7634-495c-84ae-14da921267be]
module.atlantis_task_role.data.aws_caller_identity.current: Reading...
module.atlantis_task_role.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
aws_kms_key.ecr: Refreshing state... [id=fb74c860-dfb9-498f-9937-976a098b103c]
data.aws_caller_identity.current: Reading...
aws_secretsmanager_secret.atlantis-github-app: Refreshing state... [id=arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/github-app-v2-prod-oxfqDt]
data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
module.atlantis_task_execution_role.data.aws_region.current: Reading...
module.atlantis_task_execution_role.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
module.atlantis_ecr.data.aws_caller_identity.current: Reading...
module.atlantis_ecr.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
module.atlantis_task_execution_role.data.aws_caller_identity.current: Reading...
aws_secretsmanager_secret_version.atlantis-webhook-secret[0]: Refreshing state... [id=arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/webhook-secret-v2-prod-JSD4P7|terraform-20251012142201040100000001]
module.atlantis_task_execution_role.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
aws_ecs_cluster_capacity_providers.atlantis: Refreshing state... [id=atlantis-prod]
aws_kms_alias.efs: Refreshing state... [id=alias/efs-atlantis]
aws_kms_alias.ecr: Refreshing state... [id=alias/ecr-atlantis]
aws_kms_key_policy.ecr: Refreshing state... [id=fb74c860-dfb9-498f-9937-976a098b103c]
aws_kms_key_policy.efs: Refreshing state... [id=16ebdf02-7634-495c-84ae-14da921267be]
aws_secretsmanager_secret_version.atlantis-github-app[0]: Refreshing state... [id=arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/github-app-v2-prod-oxfqDt|terraform-20251012140026441300000001]
aws_efs_access_point.atlantis: Refreshing state... [id=fsap-015fe847f3b144192]
aws_efs_mount_target.atlantis[0]: Refreshing state... [id=fsmt-06087026eb674dc79]
aws_efs_mount_target.atlantis[1]: Refreshing state... [id=fsmt-0ff0dbacfb68b58e7]
data.aws_vpc.main: Read complete after 0s [id=vpc-0f162b9e588276e09]
data.aws_subnets.private: Reading...
aws_iam_role_policy.atlantis-efs-access: Refreshing state... [id=atlantis-ecs-task-prod:atlantis-efs-access]
data.aws_subnets.private: Read complete after 0s [id=ap-northeast-2]
aws_ecs_task_definition.atlantis: Refreshing state... [id=atlantis-prod]
data.aws_route_tables.private: Reading...
aws_ecs_service.atlantis: Refreshing state... [id=arn:aws:ecs:ap-northeast-2:646886795421:service/atlantis-prod/atlantis-prod]
aws_vpc_endpoint.secretsmanager: Refreshing state... [id=vpce-0d2a42aea9646d5f1]
aws_vpc_endpoint.logs: Refreshing state... [id=vpce-0b218cc766bee3ac8]
aws_vpc_endpoint.ecr-api: Refreshing state... [id=vpce-0771cfdc087d31c5b]
aws_vpc_endpoint.ecr-dkr: Refreshing state... [id=vpce-0a8c3a30df63ea53b]
data.aws_route_tables.private: Read complete after 0s [id=ap-northeast-2]
aws_vpc_endpoint.s3: Refreshing state... [id=vpce-00abd3a9518c62884]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # aws_cloudwatch_log_group.atlantis will be destroyed
  # (because aws_cloudwatch_log_group.atlantis is not in configuration)
  - resource "aws_cloudwatch_log_group" "atlantis" {
      - arn               = "arn:aws:logs:ap-northeast-2:646886795421:log-group:/ecs/atlantis-prod" -> null
      - id                = "/ecs/atlantis-prod" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/ecs/atlantis-prod" -> null
      - retention_in_days = 7 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "Component"   = "atlantis"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "confidential"
          - "Description" = "CloudWatch log group for Atlantis ECS tasks"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "atlantis-prod"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "atlantis"
        } -> null
      - tags_all          = {
          - "Component"   = "atlantis"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "confidential"
          - "Description" = "CloudWatch log group for Atlantis ECS tasks"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "atlantis-prod"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "atlantis"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # aws_ecr_lifecycle_policy.atlantis will be destroyed
  # (because aws_ecr_lifecycle_policy.atlantis is not in configuration)
  - resource "aws_ecr_lifecycle_policy" "atlantis" {
      - id          = "atlantis" -> null
      - policy      = jsonencode(
            {
              - rules = [
                  - {
                      - action       = {
                          - type = "expire"
                        }
                      - description  = "Keep last 10 images"
                      - rulePriority = 1
                      - selection    = {
                          - countNumber   = 10
                          - countType     = "imageCountMoreThan"
                          - tagPrefixList = [
                              - "v",
                            ]
                          - tagStatus     = "tagged"
                        }
                    },
                  - {
                      - action       = {
                          - type = "expire"
                        }
                      - description  = "Remove untagged images after 7 days"
                      - rulePriority = 2
                      - selection    = {
                          - countNumber = 7
                          - countType   = "sinceImagePushed"
                          - countUnit   = "days"
                          - tagStatus   = "untagged"
                        }
                    },
                ]
            }
        ) -> null
      - registry_id = "646886795421" -> null
      - repository  = "atlantis" -> null
    }

  # aws_ecr_repository_policy.atlantis will be destroyed
  # (because aws_ecr_repository_policy.atlantis is not in configuration)
  - resource "aws_ecr_repository_policy" "atlantis" {
      - id          = "atlantis" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                          - "ecr:PutImage",
                          - "ecr:InitiateLayerUpload",
                          - "ecr:UploadLayerPart",
                          - "ecr:CompleteLayerUpload",
                          - "ecr:DescribeImages",
                          - "ecr:ListImages",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::646886795421:root"
                        }
                      - Sid       = "AllowPushPull"
                    },
                  - {
                      - Action    = [
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ecs-tasks.amazonaws.com"
                        }
                      - Sid       = "AllowECSTaskExecution"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
      - registry_id = "646886795421" -> null
      - repository  = "atlantis" -> null
    }

  # aws_ecs_cluster.atlantis will be updated in-place
  ~ resource "aws_ecs_cluster" "atlantis" {
        id       = "arn:aws:ecs:ap-northeast-2:646886795421:cluster/atlantis-prod"
        name     = "atlantis-prod"
      ~ tags     = {
            "Component"   = "atlantis"
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Description" = "ECS cluster for Atlantis Terraform automation server"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
            "ManagedBy"   = "terraform"
            "Name"        = "atlantis-prod"
            "Owner"       = "platform-team"
            "Project"     = "infrastructure"
            "Service"     = "atlantis"
          + "Team"        = "platform-team"
        }
      ~ tags_all = {
          + "Team"        = "platform-team"
            # (11 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_ecs_service.atlantis will be updated in-place
  ~ resource "aws_ecs_service" "atlantis" {
        id                                 = "arn:aws:ecs:ap-northeast-2:646886795421:service/atlantis-prod/atlantis-prod"
        name                               = "atlantis-prod"
      ~ tags                               = {
            "Component"   = "atlantis"
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Description" = "ECS service for Atlantis Terraform automation server"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
            "ManagedBy"   = "terraform"
            "Name"        = "atlantis-prod"
            "Owner"       = "platform-team"
            "Project"     = "infrastructure"
            "Service"     = "atlantis"
          + "Team"        = "platform-team"
        }
      ~ tags_all                           = {
          + "Team"        = "platform-team"
            # (11 unchanged elements hidden)
        }
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/atlantis-prod:9" -> (known after apply)
        # (15 unchanged attributes hidden)

      - load_balancer {
          - container_name   = "atlantis" -> null
          - container_port   = 4141 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:targetgroup/atl-20251011072359287200000001/2c46e9934484e453" -> null
            # (1 unchanged attribute hidden)
        }
      + load_balancer {
          + container_name   = "atlantis"
          + container_port   = 4141
          + target_group_arn = (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ network_configuration {
          ~ security_groups  = [
              - "sg-09eda99303e72ca2d",
            ] -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.atlantis must be replaced
-/+ resource "aws_ecs_task_definition" "atlantis" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/atlantis-prod:8" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/atlantis-prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - environment      = [
                      - {
                          - name  = "ATLANTIS_ATLANTIS_URL"
                          - value = "https://atlantis.set-of.com"
                        },
                      - {
                          - name  = "ATLANTIS_LOG_LEVEL"
                          - value = "debug"
                        },
                      - {
                          - name  = "ATLANTIS_PORT"
                          - value = "4141"
                        },
                      - {
                          - name  = "ATLANTIS_REPO_ALLOWLIST"
                          - value = "github.com/ryu-qqq/*"
                        },
                      - {
                          - name  = "ATLANTIS_REPO_CONFIG"
                          - value = "/home/atlantis/repos.yaml"
                        },
                      - {
                          - name  = "ATLANTIS_WRITE_GIT_CREDS"
                          - value = "true"
                        },
                    ]
                  - essential        = true
                  - healthCheck      = {
                      - command     = [
                          - "CMD-SHELL",
                          - "curl -f http://localhost:4141/healthz || exit 1",
                        ]
                      - interval    = 30
                      - retries     = 3
                      - startPeriod = 60
                      - timeout     = 5
                    }
                  - image            = "646886795421.dkr.ecr.ap-northeast-2.amazonaws.com/atlantis:v0.30.0"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/ecs/atlantis-prod"
                          - awslogs-region        = "ap-northeast-2"
                          - awslogs-stream-prefix = "atlantis"
                        }
                    }
                  - mountPoints      = [
                      - {
                          - containerPath = "/home/atlantis/.atlantis"
                          - readOnly      = false
                          - sourceVolume  = "atlantis-data"
                        },
                    ]
                  - name             = "atlantis"
                  - portMappings     = [
                      - {
                          - containerPort = 4141
                          - hostPort      = 4141
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "ATLANTIS_GH_APP_ID"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/github-app-v2-prod-oxfqDt:app_id::"
                        },
                      - {
                          - name      = "ATLANTIS_GH_APP_INSTALLATION_ID"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/github-app-v2-prod-oxfqDt:installation_id::"
                        },
                      - {
                          - name      = "ATLANTIS_GH_APP_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/github-app-v2-prod-oxfqDt:private_key::"
                        },
                      - {
                          - name      = "ATLANTIS_GH_WEBHOOK_SECRET"
                          - valueFrom = "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/webhook-secret-v2-prod-JSD4P7:webhook_secret::"
                        },
                    ]
                  - systemControls   = []
                  - ulimits          = [
                      - {
                          - hardLimit = 65536
                          - name      = "nofile"
                          - softLimit = 65536
                        },
                    ]
                  - volumesFrom      = []
                },
            ] # forces replacement
        ) -> (known after apply) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ execution_role_arn       = "arn:aws:iam::646886795421:role/atlantis-ecs-task-execution-prod" # forces replacement -> (known after apply) # forces replacement
      ~ id                       = "atlantis-prod" -> (known after apply)
      ~ revision                 = 8 -> (known after apply)
      ~ tags                     = {
            "Component"   = "atlantis"
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Description" = "ECS task definition for Atlantis Terraform automation server"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
            "ManagedBy"   = "terraform"
            "Name"        = "atlantis-prod"
            "Owner"       = "platform-team"
            "Project"     = "infrastructure"
            "Service"     = "atlantis"
          + "Team"        = "platform-team"
        }
      ~ tags_all                 = {
          + "Team"        = "platform-team"
            # (11 unchanged elements hidden)
        }
      ~ task_role_arn            = "arn:aws:iam::646886795421:role/atlantis-ecs-task-prod" # forces replacement -> (known after apply) # forces replacement
        # (9 unchanged attributes hidden)

      - volume {
          - configure_at_launch = false -> null
          - name                = "atlantis-data" -> null
            # (1 unchanged attribute hidden)

          - efs_volume_configuration {
              - file_system_id          = "fs-0404558fae26deb97" -> null
              - root_directory          = "/" -> null
              - transit_encryption      = "ENABLED" -> null
              - transit_encryption_port = 2049 -> null

              - authorization_config {
                  - access_point_id = "fsap-015fe847f3b144192" -> null
                  - iam             = "ENABLED" -> null
                }
            }
        }
      + volume {
          + configure_at_launch = (known after apply)
          + name                = "atlantis-data"
            # (1 unchanged attribute hidden)

          + efs_volume_configuration {
              + file_system_id          = "fs-0404558fae26deb97"
              + root_directory          = "/"
              + transit_encryption      = "ENABLED"
              + transit_encryption_port = 2049

              + authorization_config {
                  + access_point_id = "fsap-015fe847f3b144192"
                  + iam             = "ENABLED"
                }
            }
        }
    }

  # aws_efs_access_point.atlantis will be updated in-place
  ~ resource "aws_efs_access_point" "atlantis" {
        id              = "fsap-015fe847f3b144192"
      ~ tags            = {
            "Component"   = "atlantis"
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Description" = "EFS access point for Atlantis data directory"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
            "ManagedBy"   = "terraform"
            "Name"        = "atlantis-prod"
            "Owner"       = "platform-team"
            "Project"     = "infrastructure"
            "Service"     = "atlantis"
          + "Team"        = "platform-team"
        }
      ~ tags_all        = {
          + "Team"        = "platform-team"
            # (11 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_efs_file_system.atlantis will be updated in-place
  ~ resource "aws_efs_file_system" "atlantis" {
        id                              = "fs-0404558fae26deb97"
        name                            = "atlantis-prod"
      ~ tags                            = {
            "Component"   = "atlantis"
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Description" = "EFS file system for Atlantis persistent data storage"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
            "ManagedBy"   = "terraform"
            "Name"        = "atlantis-prod"
            "Owner"       = "platform-team"
            "Project"     = "infrastructure"
            "Service"     = "atlantis"
          + "Team"        = "platform-team"
        }
      ~ tags_all                        = {
          + "Team"        = "platform-team"
            # (11 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_efs_mount_target.atlantis[0] will be updated in-place
  ~ resource "aws_efs_mount_target" "atlantis" {
        id                     = "fsmt-06087026eb674dc79"
      ~ security_groups        = [
          - "sg-00b4a4594212637d2",
        ] -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_efs_mount_target.atlantis[1] will be updated in-place
  ~ resource "aws_efs_mount_target" "atlantis" {
        id                     = "fsmt-0ff0dbacfb68b58e7"
      ~ security_groups        = [
          - "sg-00b4a4594212637d2",
        ] -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_iam_role.ecs-task will be destroyed
  # (because aws_iam_role.ecs-task is not in configuration)
  - resource "aws_iam_role" "ecs-task" {
      - arn                   = "arn:aws:iam::646886795421:role/atlantis-ecs-task-prod" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-10-11T07:23:59Z" -> null
      - force_detach_policies = false -> null
      - id                    = "atlantis-ecs-task-prod" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "atlantis-ecs-task-prod" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "Component"   = "atlantis"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "confidential"
          - "Description" = "ECS task role for Atlantis Terraform operations"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "atlantis-ecs-task-prod"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "atlantis"
        } -> null
      - tags_all              = {
          - "Component"   = "atlantis"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "confidential"
          - "Description" = "ECS task role for Atlantis Terraform operations"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "atlantis-ecs-task-prod"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "atlantis"
        } -> null
      - unique_id             = "AROAZNHLVFCOTG24CDXY7" -> null
        # (3 unchanged attributes hidden)

      - inline_policy {
          - name   = "AdditionalFileflowPermissions" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:ListTagsForResource",
                              - "logs:TagResource",
                              - "logs:UntagResource",
                            ]
                          - Effect   = "Allow"
                          - Resource = "*"
                          - Sid      = "CloudWatchLogsTagManagement"
                        },
                      - {
                          - Action    = [
                              - "kms:Encrypt",
                              - "kms:Decrypt",
                              - "kms:GenerateDataKey",
                              - "kms:CreateGrant",
                            ]
                          - Condition = {
                              - StringEquals = {
                                  - "kms:ViaService" = [
                                      - "secretsmanager.ap-northeast-2.amazonaws.com",
                                    ]
                                }
                            }
                          - Effect    = "Allow"
                          - Resource  = "*"
                          - Sid       = "KMSSecretsManagerAccess"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "ApplicationAutoScalingPermissions" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "application-autoscaling:RegisterScalableTarget",
                              - "application-autoscaling:DeregisterScalableTarget",
                              - "application-autoscaling:DescribeScalableTargets",
                              - "application-autoscaling:PutScalingPolicy",
                              - "application-autoscaling:DeleteScalingPolicy",
                              - "application-autoscaling:DescribeScalingPolicies",
                              - "application-autoscaling:TagResource",
                              - "application-autoscaling:UntagResource",
                              - "application-autoscaling:ListTagsForResource",
                            ]
                          - Effect   = "Allow"
                          - Resource = "*"
                          - Sid      = "ApplicationAutoScalingManagement"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "CloudWatchAlarmsPermissions" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "cloudwatch:DescribeAlarms",
                              - "cloudwatch:PutMetricAlarm",
                              - "cloudwatch:DeleteAlarms",
                              - "cloudwatch:ListTagsForResource",
                              - "cloudwatch:TagResource",
                              - "cloudwatch:UntagResource",
                            ]
                          - Effect   = "Allow"
                          - Resource = "*"
                          - Sid      = "CloudWatchAlarmsManagement"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "atlantis-assume-target-role" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = "sts:AssumeRole"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:iam::646886795421:role/atlantis-target-prod"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "atlantis-cloudwatch-logs" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:CreateLogGroup",
                              - "logs:CreateLogStream",
                              - "logs:PutLogEvents",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:logs:ap-northeast-2:646886795421:log-group:/ecs/atlantis-prod:*"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "atlantis-efs-access" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action    = [
                              - "elasticfilesystem:ClientMount",
                              - "elasticfilesystem:ClientWrite",
                              - "elasticfilesystem:ClientRootAccess",
                            ]
                          - Condition = {
                              - StringEquals = {
                                  - "elasticfilesystem:AccessPointArn" = "arn:aws:elasticfilesystem:ap-northeast-2:646886795421:access-point/fsap-015fe847f3b144192"
                                }
                            }
                          - Effect    = "Allow"
                          - Resource  = "arn:aws:elasticfilesystem:ap-northeast-2:646886795421:file-system/fs-0404558fae26deb97"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "terraform-operations-temp" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "s3:ListBucket",
                              - "s3:GetObject",
                              - "s3:PutObject",
                              - "s3:DeleteObject",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:s3:::terraform-state-*",
                              - "arn:aws:s3:::terraform-state-*/*",
                              - "arn:aws:s3:::prod-tfstate",
                              - "arn:aws:s3:::prod-tfstate/*",
                              - "arn:aws:s3:::prod-connectly",
                              - "arn:aws:s3:::prod-connectly/*",
                            ]
                          - Sid      = "TerraformStateAccess"
                        },
                      - {
                          - Action   = [
                              - "dynamodb:GetItem",
                              - "dynamodb:PutItem",
                              - "dynamodb:DeleteItem",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:dynamodb:*:646886795421:table/prod-connectly-tf-lock",
                              - "arn:aws:dynamodb:*:646886795421:table/prod-tfstate-tf-lock",
                            ]
                          - Sid      = "DynamoDBLocking"
                        },
                      - {
                          - Action   = [
                              - "ec2:Describe*",
                              - "ecs:Describe*",
                              - "ecr:Describe*",
                              - "ecr:GetLifecyclePolicy",
                              - "ecr:GetRepositoryPolicy",
                              - "elasticloadbalancing:Describe*",
                              - "elasticache:DescribeCacheSubnetGroups",
                              - "elasticache:DescribeCacheParameterGroups",
                              - "elasticache:DescribeCacheParameters",
                              - "elasticache:DescribeCacheClusters",
                              - "elasticache:ListTagsForResource",
                              - "elasticfilesystem:Describe*",
                              - "kms:Describe*",
                              - "kms:List*",
                              - "kms:GetKeyPolicy",
                              - "kms:GetKeyRotationStatus",
                              - "logs:Describe*",
                              - "logs:ListTagsForResource",
                              - "rds:DescribeDBSubnetGroups",
                              - "rds:DescribeDBParameterGroups",
                              - "rds:DescribeDBParameters",
                              - "rds:DescribeDBInstances",
                              - "rds:ListTagsForResource",
                              - "secretsmanager:DescribeSecret",
                              - "secretsmanager:GetResourcePolicy",
                              - "secretsmanager:GetSecretValue",
                              - "secretsmanager:ListSecretVersionIds",
                              - "s3:List*",
                              - "sqs:GetQueueAttributes",
                              - "sqs:GetQueueUrl",
                              - "sqs:ListQueues",
                              - "sqs:ListQueueTags",
                              - "ssm:GetParameter",
                              - "ssm:GetParameters",
                              - "ssm:DescribeParameters",
                              - "ssm:ListTagsForResource",
                              - "route53:GetHostedZone",
                              - "route53:ListHostedZones",
                              - "route53:ListResourceRecordSets",
                              - "route53:GetChange",
                            ]
                          - Effect   = "Allow"
                          - Resource = "*"
                          - Sid      = "TerraformPlanOperations"
                        },
                      - {
                          - Action   = [
                              - "iam:GetRole",
                              - "iam:GetRolePolicy",
                              - "iam:GetPolicy",
                              - "iam:GetPolicyVersion",
                              - "iam:ListRoles",
                              - "iam:ListRolePolicies",
                              - "iam:ListAttachedRolePolicies",
                              - "iam:ListPolicyVersions",
                              - "iam:ListOpenIDConnectProviders",
                              - "iam:GetOpenIDConnectProvider",
                            ]
                          - Effect   = "Allow"
                          - Resource = "*"
                          - Sid      = "IAMReadOnlyForTerraformResources"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # aws_iam_role.ecs-task-execution will be destroyed
  # (because aws_iam_role.ecs-task-execution is not in configuration)
  - resource "aws_iam_role" "ecs-task-execution" {
      - arn                   = "arn:aws:iam::646886795421:role/atlantis-ecs-task-execution-prod" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-10-11T07:23:59Z" -> null
      - force_detach_policies = false -> null
      - id                    = "atlantis-ecs-task-execution-prod" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "atlantis-ecs-task-execution-prod" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "Component"   = "atlantis"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "confidential"
          - "Description" = "ECS task execution role for Atlantis"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "atlantis-ecs-task-execution-prod"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "atlantis"
        } -> null
      - tags_all              = {
          - "Component"   = "atlantis"
          - "CostCenter"  = "engineering"
          - "DataClass"   = "confidential"
          - "Description" = "ECS task execution role for Atlantis"
          - "Environment" = "prod"
          - "Lifecycle"   = "permanent"
          - "ManagedBy"   = "terraform"
          - "Name"        = "atlantis-ecs-task-execution-prod"
          - "Owner"       = "platform-team"
          - "Project"     = "infrastructure"
          - "Service"     = "atlantis"
        } -> null
      - unique_id             = "AROAZNHLVFCOYFXARZBBF" -> null
        # (3 unchanged attributes hidden)

      - inline_policy {
          - name   = "atlantis-ecs-task-execution-kms" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "kms:Decrypt",
                              - "kms:DescribeKey",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:kms:ap-northeast-2:646886795421:key/fb74c860-dfb9-498f-9937-976a098b103c"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "atlantis-ecs-task-execution-secrets" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "secretsmanager:GetSecretValue",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/github-app-v2-prod-oxfqDt",
                              - "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/webhook-secret-v2-prod-JSD4P7",
                            ]
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # aws_iam_role_policy.atlantis-cloudwatch-logs will be destroyed
  # (because aws_iam_role_policy.atlantis-cloudwatch-logs is not in configuration)
  - resource "aws_iam_role_policy" "atlantis-cloudwatch-logs" {
      - id          = "atlantis-ecs-task-prod:atlantis-cloudwatch-logs" -> null
      - name        = "atlantis-cloudwatch-logs" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:CreateLogGroup",
                          - "logs:CreateLogStream",
                          - "logs:PutLogEvents",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ap-northeast-2:646886795421:log-group:/ecs/atlantis-prod:*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "atlantis-ecs-task-prod" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy.atlantis-efs-access must be replaced
-/+ resource "aws_iam_role_policy" "atlantis-efs-access" {
      ~ id          = "atlantis-ecs-task-prod:atlantis-efs-access" -> (known after apply)
      ~ name        = "atlantis-efs-access" -> "efs-access" # forces replacement
      + name_prefix = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role_policy.atlantis-task-execution-kms will be created
  + resource "aws_iam_role_policy" "atlantis-task-execution-kms" {
      + id          = (known after apply)
      + name        = "kms-decryption"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "kms:Decrypt",
                          + "kms:DescribeKey",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:kms:ap-northeast-2:646886795421:key/fb74c860-dfb9-498f-9937-976a098b103c"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "atlantis-ecs-task-execution-prod"
    }

  # aws_iam_role_policy.atlantis-task-execution-secrets will be created
  + resource "aws_iam_role_policy" "atlantis-task-execution-secrets" {
      + id          = (known after apply)
      + name        = "secrets-access"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "secretsmanager:GetSecretValue",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/github-app-v2-prod-oxfqDt",
                          + "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/webhook-secret-v2-prod-JSD4P7",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "atlantis-ecs-task-execution-prod"
    }

  # aws_iam_role_policy.atlantis-terraform-operations will be created
  + resource "aws_iam_role_policy" "atlantis-terraform-operations" {
      + id          = (known after apply)
      + name        = "terraform-operations"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                          + "s3:GetObject",
                          + "s3:PutObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::terraform-state-*",
                          + "arn:aws:s3:::terraform-state-*/*",
                          + "arn:aws:s3:::prod-tfstate",
                          + "arn:aws:s3:::prod-tfstate/*",
                          + "arn:aws:s3:::prod-connectly",
                          + "arn:aws:s3:::prod-connectly/*",
                        ]
                      + Sid      = "TerraformStateAccess"
                    },
                  + {
                      + Action   = [
                          + "dynamodb:GetItem",
                          + "dynamodb:PutItem",
                          + "dynamodb:DeleteItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:dynamodb:*:646886795421:table/prod-tfstate-tf-lock",
                          + "arn:aws:dynamodb:*:646886795421:table/prod-tfstate-tf-lock",
                          + "arn:aws:dynamodb:*:646886795421:table/prod-connectly-tf-lock",
                        ]
                      + Sid      = "DynamoDBLocking"
                    },
                  + {
                      + Action   = [
                          + "ec2:Describe*",
                          + "ecs:Describe*",
                          + "ecr:Describe*",
                          + "elasticloadbalancing:Describe*",
                          + "elasticache:DescribeCacheSubnetGroups",
                          + "elasticache:DescribeCacheParameterGroups",
                          + "elasticache:DescribeCacheParameters",
                          + "elasticache:DescribeCacheClusters",
                          + "elasticache:ListTagsForResource",
                          + "elasticfilesystem:Describe*",
                          + "kms:Describe*",
                          + "kms:List*",
                          + "kms:GetKeyPolicy",
                          + "kms:GetKeyRotationStatus",
                          + "logs:Describe*",
                          + "logs:ListTagsForResource",
                          + "rds:DescribeDBSubnetGroups",
                          + "rds:DescribeDBParameterGroups",
                          + "rds:DescribeDBParameters",
                          + "rds:DescribeDBInstances",
                          + "rds:ListTagsForResource",
                          + "secretsmanager:DescribeSecret",
                          + "secretsmanager:GetResourcePolicy",
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:ListSecretVersionIds",
                          + "s3:List*",
                          + "sqs:GetQueueAttributes",
                          + "sqs:GetQueueUrl",
                          + "sqs:ListQueues",
                          + "sqs:ListQueueTags",
                          + "ssm:GetParameter",
                          + "ssm:GetParameters",
                          + "ssm:DescribeParameters",
                          + "ssm:ListTagsForResource",
                          + "route53:GetHostedZone",
                          + "route53:ListHostedZones",
                          + "route53:ListResourceRecordSets",
                          + "route53:GetChange",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "TerraformPlanOperations"
                    },
                  + {
                      + Action   = [
                          + "iam:GetRole",
                          + "iam:GetRolePolicy",
                          + "iam:GetPolicy",
                          + "iam:GetPolicyVersion",
                          + "iam:ListRoles",
                          + "iam:ListRolePolicies",
                          + "iam:ListAttachedRolePolicies",
                          + "iam:ListPolicyVersions",
                          + "iam:ListOpenIDConnectProviders",
                          + "iam:GetOpenIDConnectProvider",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "IAMReadOnlyForTerraformResources"
                    },
                  + {
                      + Action   = [
                          + "iam:PutRolePolicy",
                          + "iam:DeleteRolePolicy",
                          + "iam:GetRolePolicy",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:iam::646886795421:role/fileflow-prod-*"
                      + Sid      = "ManageECSRoles"
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:CreateSecurityGroup",
                          + "ec2:DeleteSecurityGroup",
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:AuthorizeSecurityGroupEgress",
                          + "ec2:RevokeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupEgress",
                          + "ec2:CreateTags",
                          + "ec2:DeleteTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ec2:ap-northeast-2:646886795421:security-group/*",
                          + "arn:aws:ec2:ap-northeast-2:646886795421:vpc/*",
                        ]
                      + Sid      = "ManageSecurityGroups"
                    },
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:DeleteLogGroup",
                          + "logs:DescribeLogGroups",
                          + "logs:PutRetentionPolicy",
                          + "logs:DeleteRetentionPolicy",
                          + "logs:TagResource",
                          + "logs:TagLogGroup",
                          + "logs:UntagLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ManageCloudWatchLogs"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:DescribeTargetGroups",
                          + "elasticloadbalancing:ModifyTargetGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ManageTargetGroups"
                    },
                  + {
                      + Action   = [
                          + "s3:GetBucketPolicy",
                          + "s3:PutBucketPolicy",
                          + "s3:DeleteBucketPolicy",
                          + "s3:GetBucketAcl",
                          + "s3:PutBucketAcl",
                          + "s3:GetBucketVersioning",
                          + "s3:PutBucketVersioning",
                          + "s3:GetBucketLogging",
                          + "s3:PutBucketLogging",
                          + "s3:GetEncryptionConfiguration",
                          + "s3:PutEncryptionConfiguration",
                          + "s3:GetBucketPublicAccessBlock",
                          + "s3:PutBucketPublicAccessBlock",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::fileflow-*"
                      + Sid      = "ManageS3Buckets"
                    },
                  + {
                      + Action   = [
                          + "elasticache:CreateCacheSubnetGroup",
                          + "elasticache:DeleteCacheSubnetGroup",
                          + "elasticache:ModifyCacheSubnetGroup",
                          + "elasticache:CreateReplicationGroup",
                          + "elasticache:DeleteReplicationGroup",
                          + "elasticache:ModifyReplicationGroup",
                          + "elasticache:AddTagsToResource",
                          + "elasticache:RemoveTagsFromResource",
                          + "elasticache:CreateCacheParameterGroup",
                          + "elasticache:DeleteCacheParameterGroup",
                          + "elasticache:ModifyCacheParameterGroup",
                          + "elasticache:DescribeReplicationGroups",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ManageElastiCache"
                    },
                  + {
                      + Action   = [
                          + "sqs:CreateQueue",
                          + "sqs:DeleteQueue",
                          + "sqs:SetQueueAttributes",
                          + "sqs:TagQueue",
                          + "sqs:UntagQueue",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:sqs:ap-northeast-2:646886795421:*"
                      + Sid      = "ManageSQS"
                    },
                  + {
                      + Action   = [
                          + "cloudwatch:PutMetricAlarm",
                          + "cloudwatch:DeleteAlarms",
                          + "cloudwatch:DescribeAlarms",
                          + "cloudwatch:TagResource",
                          + "cloudwatch:UntagResource",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:cloudwatch:ap-northeast-2:646886795421:alarm:*"
                      + Sid      = "ManageCloudWatchAlarms"
                    },
                  + {
                      + Action   = [
                          + "ecs:CreateCluster",
                          + "ecs:DeleteCluster",
                          + "ecs:UpdateCluster",
                          + "ecs:RegisterTaskDefinition",
                          + "ecs:DeregisterTaskDefinition",
                          + "ecs:CreateService",
                          + "ecs:UpdateService",
                          + "ecs:DeleteService",
                          + "ecs:TagResource",
                          + "ecs:UntagResource",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ManageECS"
                    },
                  + {
                      + Action   = [
                          + "iam:CreateRole",
                          + "iam:DeleteRole",
                          + "iam:AttachRolePolicy",
                          + "iam:DetachRolePolicy",
                          + "iam:PutRolePolicy",
                          + "iam:DeleteRolePolicy",
                          + "iam:PassRole",
                          + "iam:TagRole",
                          + "iam:UntagRole",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:iam::646886795421:role/fileflow-*",
                          + "arn:aws:iam::646886795421:role/atlantis-*",
                        ]
                      + Sid      = "ManageIAMRoles"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:CreateLoadBalancer",
                          + "elasticloadbalancing:DeleteLoadBalancer",
                          + "elasticloadbalancing:CreateTargetGroup",
                          + "elasticloadbalancing:DeleteTargetGroup",
                          + "elasticloadbalancing:CreateListener",
                          + "elasticloadbalancing:DeleteListener",
                          + "elasticloadbalancing:ModifyListener",
                          + "elasticloadbalancing:ModifyTargetGroupAttributes",
                          + "elasticloadbalancing:ModifyLoadBalancerAttributes",
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:RemoveTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ManageLoadBalancers"
                    },
                  + {
                      + Action   = [
                          + "ecr:CreateRepository",
                          + "ecr:DeleteRepository",
                          + "ecr:PutLifecyclePolicy",
                          + "ecr:DeleteLifecyclePolicy",
                          + "ecr:SetRepositoryPolicy",
                          + "ecr:DeleteRepositoryPolicy",
                          + "ecr:TagResource",
                          + "ecr:UntagResource",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecr:ap-northeast-2:646886795421:repository/*"
                      + Sid      = "ManageECR"
                    },
                  + {
                      + Action   = [
                          + "rds:CreateDBInstance",
                          + "rds:DeleteDBInstance",
                          + "rds:ModifyDBInstance",
                          + "rds:CreateDBSubnetGroup",
                          + "rds:DeleteDBSubnetGroup",
                          + "rds:CreateDBParameterGroup",
                          + "rds:DeleteDBParameterGroup",
                          + "rds:ModifyDBParameterGroup",
                          + "rds:AddTagsToResource",
                          + "rds:RemoveTagsFromResource",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ManageRDS"
                    },
                  + {
                      + Action   = [
                          + "ec2:CreateVpc",
                          + "ec2:DeleteVpc",
                          + "ec2:ModifyVpcAttribute",
                          + "ec2:CreateSubnet",
                          + "ec2:DeleteSubnet",
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeSubnets",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ManageVPC"
                    },
                  + {
                      + Action   = [
                          + "route53:ChangeResourceRecordSets",
                          + "route53:GetChange",
                          + "route53:ListResourceRecordSets",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:route53:::hostedzone/*",
                          + "arn:aws:route53:::change/*",
                        ]
                      + Sid      = "ManageRoute53Records"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "atlantis-ecs-task-prod"
    }

  # aws_iam_role_policy.ecs-task-execution-kms will be destroyed
  # (because aws_iam_role_policy.ecs-task-execution-kms is not in configuration)
  - resource "aws_iam_role_policy" "ecs-task-execution-kms" {
      - id          = "atlantis-ecs-task-execution-prod:atlantis-ecs-task-execution-kms" -> null
      - name        = "atlantis-ecs-task-execution-kms" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "kms:Decrypt",
                          - "kms:DescribeKey",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:kms:ap-northeast-2:646886795421:key/fb74c860-dfb9-498f-9937-976a098b103c"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "atlantis-ecs-task-execution-prod" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy.ecs-task-execution-secrets will be destroyed
  # (because aws_iam_role_policy.ecs-task-execution-secrets is not in configuration)
  - resource "aws_iam_role_policy" "ecs-task-execution-secrets" {
      - id          = "atlantis-ecs-task-execution-prod:atlantis-ecs-task-execution-secrets" -> null
      - name        = "atlantis-ecs-task-execution-secrets" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "secretsmanager:GetSecretValue",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/github-app-v2-prod-oxfqDt",
                          - "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/webhook-secret-v2-prod-JSD4P7",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "atlantis-ecs-task-execution-prod" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy_attachment.atlantis-task-execution-policy will be created
  + resource "aws_iam_role_policy_attachment" "atlantis-task-execution-policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "atlantis-ecs-task-execution-prod"
    }

  # aws_iam_role_policy_attachment.ecs-task-execution-policy will be destroyed
  # (because aws_iam_role_policy_attachment.ecs-task-execution-policy is not in configuration)
  - resource "aws_iam_role_policy_attachment" "ecs-task-execution-policy" {
      - id         = "atlantis-ecs-task-execution-prod-20251011072359683400000003" -> null
      - policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy" -> null
      - role       = "atlantis-ecs-task-execution-prod" -> null
    }

  # aws_kms_key.ecr will be updated in-place
  ~ resource "aws_kms_key" "ecr" {
        id                                 = "fb74c860-dfb9-498f-9937-976a098b103c"
      ~ tags                               = {
            "Component"   = "atlantis"
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
            "ManagedBy"   = "terraform"
            "Name"        = "ecr-atlantis"
            "Owner"       = "platform-team"
            "Project"     = "infrastructure"
            "Service"     = "atlantis"
          + "Team"        = "platform-team"
        }
      ~ tags_all                           = {
          + "Team"        = "platform-team"
            # (10 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # aws_kms_key.efs will be updated in-place
  ~ resource "aws_kms_key" "efs" {
        id  
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.